driver-tests/bpelse/assign/AssignJbi/test/results/echoBooleanDataType_Invoke/Actual_20130318180028_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="http://stc.com/echoBooleanDataType" xmlns:msgns="http://stc.com/echoBooleanDataType">
      <string>true</string>
      <normalizedString>true</normalizedString>
      <token>true</token>
      <base64Binary>true</base64Binary>
      <hexBinary>true</hexBinary>
      <integer>true</integer>
      <positiveInteger>true</positiveInteger>
      <negativeInteger>true</negativeInteger>
      <nonNegativeInteger>true</nonNegativeInteger>
      <nonPositiveInteger>true</nonPositiveInteger>
      <long>true</long>
      <unsignedLong>true</unsignedLong>
      <int>true</int>
      <unsignedInt>true</unsignedInt>
      <short>true</short>
      <unsignedShort>true</unsignedShort>
      <byte>true</byte>
      <unsignedByte>true</unsignedByte>
      <decimal>true</decimal>
      <float>true</float>
      <double>true</double>
      <boolean>true</boolean>
      <duration>true</duration>
      <dateTime>true</dateTime>
      <date>true</date>
      <time>true</time>
      <gYear>true</gYear>
      <gYearMonth>true</gYearMonth>
      <gMonth>true</gMonth>
      <gMonthDay>true</gMonthDay>
      <gDay>true</gDay>
      <Name>true</Name>
      <QName>true</QName>
      <NCName>true</NCName>
      <anyURI>true</anyURI>
      <language>true</language>
      <ID>true</ID>
      <IDREF>true</IDREF>
      <IDREFS>true</IDREFS>
      <ENTITY>true</ENTITY>
      <ENTITIES>true</ENTITIES>
      <NMTOKEN>true</NMTOKEN>
      <NMTOKENS>true</NMTOKENS>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>